<?php
/**
 * Праздник как воскресенье - глобальная константа
 *  в таблице sunday = 1 праздник как воскресенье.
 * по умолчанию (если праздник то берётся сумма с воскресенья) - sunday_prices
 * добавлена возможность назначать рабочие часы с воскресенья - sunday_times
 * По умолчанию на аренах и ck включен, на ядре выключен
 * если sunday = 1 и нет других параметров то по умолчанию используем `sunday_prices`
 */
defined('HOLIDAY_LIKE_SUNDAY') || define('HOLIDAY_LIKE_SUNDAY', true);

/**
 *  Константа определяющая нужна ли проверка при создании праздника, что в этот день есть бронирования, абонементы и блокировки.
 * Если что-то есть, то праздник не создается.
 */
defined('CHECK_BLOCKING_EVENTS_FOR_HOLIDAYS') || define('CHECK_BLOCKING_EVENTS_FOR_HOLIDAYS', false);

/**
 * Возможность назначать время работы у праздника как время работы воскресенья
 */
defined('HOLIDAY_SUNDAY_TIMES') || define('HOLIDAY_SUNDAY_TIMES', false);
